# -*- coding:utf-8 -*-
__author__ = 'gjw'
__time__ = '2018/1/4 0004 上午 10:47'

# 题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？

"""
程序分析：
假设该数为 x。
1、则：x + 100 = n2, x + 100 + 168 = m2
2、计算等式：m2 - n2 = (m + n)(m - n) = 168
3、设置： m + n = i，m - n = j，i * j =168，i 和 j 至少一个是偶数
4、可得： m = (i + j) / 2， n = (i - j) / 2，i 和 j 要么都是偶数，要么都是奇数。
5、从 3 和 4 推导可知道，i 与 j 均是大于等于 2 的偶数。
6、由于 i * j = 168， j>=2，则 1 < i < 168 / 2 + 1。
7、接下来将 i 的所有数字循环计算即可。
"""

for i in range(1, 85):
    if 168 % i == 0:
        j = 168 / i
        if i > j and (i + j) % 2 == 0 and (i-j) % 2 == 0:
            m = (i + j)/2
            n = (i - j)/2
            x = n*n-100
            print(int(x))

# 优化版
"""
设该数为x：x + 100 = n^2, n^2 + 168 = m^2。
设m=n+k（不妨设m,n,k均为自然数）：带入m^2-n^2-168，得k^2+2nk=168。
解得n=84/k - k/2；由于n,k均为自然数，则nk>=1，故1< =k^2<168，故1<=k<=12。 
"""
print("我是new版")
for x in range(1, 13):
    a = 84/x - x/2
    if int(a) == a:
        n = a ** 2 - 100
        print(int(n))

# 通俗简化版
print("我是newnew版")
for m in range(168):
    for n in range(m):
        if (m+n)*(m-n) == 168:
            x = n**2-100
            print("符合条件的整数有:",x)